// See https://aka.ms/new-console-template for more information


// 1. Написать метод, рассчитывающий число из рада Фиббоначчи используя рекурсию
// 2. Дано натуральное число (вводится с клавиатуры). Вычислите сумму его цифр используя рекурсию
// 3. Дано натуральное число больше 1 (вводится с клавиатуры). Выведите все простые делители этого числа используя рекурсию
// 4. Данонатуральноечислобольше1(вводитсясклавиатуры).Выведите«Точная степень двойки», если число является точной степенью 
// двойки, или «Не являеться степенью двойки», в противном случае используя рекурсию.
// 5. Написать метод возвращающий индекс максимального и минимального значения массива (два способа используя кортеж и out).
// 6. На входе 2 числа, написать метод по замене местами чисел в переменных, если первое число кратно двум, второе не кратно 
// и первое число меньше двух (результат вернуть в виде кортежа)
// 7. Дана строка. Написать метод по подсчёту количеству вхождений символа (подстроки). Метод возвращает символ (подстроку),
//  количество вхождений, перое и последнее вхождение в строку. (использовать IndexOf, LastIndexOf, Split и тд запрещено)