// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");


// 1. На входе дано три массива заполненных случайными числами. Написать метод по подсчёту общего количества чётных чисел в массивах. (ref)

// 2. Написать метод, который проверяет является ли введнная строка почтовым адрессом и возвращающий домен почты.(out)

// 3. Написать метод, который удаляет из строки заданный символ. Символ является входным параметром-значением. Строка должна быть параметром-ссылкой и результатом. (ref)
// 4. Написатьметодвыполняющийсложениепарметов,еслипараметрыодноготипа данных возвращать true и результат сложение, в противном случае false (out)
// 5. Пользователь вводит строку и разделитель. Написать метод возвращающий наличие в строке разделителя, если разделитель есть вернуть строку разбитую данным разделителем (out)
// 6. Написать метод возвращающий разность между найбольшим и наименьшим значением из списка. Результат разности возращать через out, метод для поиска минимального и максимального написать с использованием params
// 7. Написать метод который принимает строку, если строка содержит только 0 и 1 вернуть true, а 0 и 1 перевести в 10-ную систему счисления, в противном случае false (out)
// 8. Навходеметоданабор0и1перевестив16-нуюсистемусчисления(params)